SpenceKonde/ATTinyCore/avr/boards.txt
attinyx7opti.name=ATtiny167/87 (Optiboot)
attinyx7opti.upload.maximum_data_size=512
attinyx7opti.upload.protocol=arduino
attinyx7opti.upload.tool=avrdude
attinyx7opti.build.board=AVR_ATTINYX7
attinyx7opti.bootloader.tool=avrdude
attinyx7opti.bootloader.unlock_bits=0xFF
attinyx7opti.bootloader.lock_bits=0xFF
attinyx7opti.build.core=tiny
attinyx7opti.bootloader.extended_fuses=0xFE
attinyx7opti.menu.LTO.disable=Disabled
attinyx7opti.menu.LTO.disable.ltocflags=
attinyx7opti.menu.LTO.disable.ltoelfflags=
attinyx7opti.menu.LTO.disable.ltocppflags=
attinyx7opti.menu.LTO.disable.ltoarcmd=
attinyx7opti.menu.LTO.enable=Enabled
attinyx7opti.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx7opti.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx7opti.menu.LTO.enable.ltocppflags=-flto
attinyx7opti.menu.LTO.enable.ltoarcmd=gcc-
attinyx7opti.menu.chip.167=ATtiny167
attinyx7opti.menu.chip.167.build.mcu=attiny167
attinyx7opti.menu.chip.167.build.export_merged_output=false
attinyx7opti.menu.chip.167.upload.maximum_size=15744
attinyx7opti.menu.chip.87=ATtiny87
attinyx7opti.menu.chip.87.build.mcu=attiny87
attinyx7opti.menu.chip.87.build.export_merged_output=true
attinyx7opti.menu.chip.87.upload.maximum_size=7552
attinyx7opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx7opti.menu.clock.8internal=8 MHz (internal)
attinyx7opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx7opti.menu.clock.8internal.build.f_cpu=8000000L
attinyx7opti.menu.clock.8internal.upload.speed=57600
attinyx7opti.menu.clock.16external=16 MHz (external)
attinyx7opti.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.16external.build.f_cpu=16000000L
attinyx7opti.menu.clock.16external.upload.speed=115200
attinyx7opti.menu.clock.12external=12 MHz (external)
attinyx7opti.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.12external.build.f_cpu=12000000L
attinyx7opti.menu.clock.12external.upload.speed=115200
attinyx7opti.menu.clock.8external=8 MHz (external)
attinyx7opti.menu.clock.8external.bootloader.low_fuses=0xFD
attinyx7opti.menu.clock.8external.build.f_cpu=8000000L
attinyx7opti.menu.clock.8external.upload.speed=57600
attinyx7opti.menu.clock.737external=7.3728 MHz (external)
attinyx7opti.menu.clock.737external.bootloader.low_fuses=0xFD
attinyx7opti.menu.clock.737external.build.f_cpu=7372800L
attinyx7opti.menu.clock.737external.upload.speed=57600
attinyx7opti.menu.clock.921external=9.216 MHz (external)
attinyx7opti.menu.clock.921external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.921external.build.f_cpu=9216000L
attinyx7opti.menu.clock.921external.upload.speed=57600
attinyx7opti.menu.clock.110external=11.0592 MHz (external)
attinyx7opti.menu.clock.110external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.110external.build.f_cpu=11059200L
attinyx7opti.menu.clock.110external.upload.speed=115200
attinyx7opti.menu.clock.147external=14.7456 MHz (external)
attinyx7opti.menu.clock.147external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.147external.build.f_cpu=14745600L
attinyx7opti.menu.clock.147external.upload.speed=115200
attinyx7opti.menu.clock.184external=18.432 MHz (external - overclocked)
attinyx7opti.menu.clock.184external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.184external.build.f_cpu=18432000L
attinyx7opti.menu.clock.184external.upload.speed=115200
attinyx7opti.menu.bod.disable=B.O.D. Disabled
attinyx7opti.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx7opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7opti.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx7opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx7opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7opti.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx7opti.menu.pinmapping.new=New style (down each side)
attinyx7opti.menu.pinmapping.new.build.variant=tinyX7_New
attinyx7opti.menu.pinmapping.old=Old style (SCL on 13)
attinyx7opti.menu.pinmapping.old.build.variant=tinyX7




attinyx61.name=ATtiny261/461/861
attinyx61.upload.maximum_size=8192
attinyx61.upload.maximum_data_size=512
attinyx61.upload.tool=avrdude
attinyx61.build.board=AVR_ATTINYX61
attinyx61.bootloader.tool=avrdude
attinyx61.bootloader.unlock_bits=0xFF
attinyx61.bootloader.lock_bits=0xFF
attinyx61.bootloader.file=empty/empty_all.hex
attinyx61.build.mcu=attiny861
attinyx61.build.core=tiny
attinyx61.build.export_merged_output=false
attinyx61.menu.LTO.disable=Disabled
attinyx61.menu.LTO.disable.ltocflags=
attinyx61.menu.LTO.disable.ltoelfflags=
attinyx61.menu.LTO.disable.ltocppflags=
attinyx61.menu.LTO.disable.ltoarcmd=
attinyx61.menu.LTO.enable=Enabled
attinyx61.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx61.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx61.menu.LTO.enable.ltocppflags=-flto
attinyx61.menu.LTO.enable.ltoarcmd=gcc-
attinyx61.menu.TimerClockSource.default=CPU
attinyx61.menu.TimerClockSource.pll=64MHz
attinyx61.menu.TimerClockSource.pll.build.extra_flags=-DPLLTIMER1
attinyx61.menu.TimerClockSource.lowpll=32MHz
attinyx61.menu.TimerClockSource.lowpll.build.extra_flags=-DLOWPLLTIMER1
attinyx61.menu.chip.861=ATtiny861
attinyx61.menu.chip.861.build.mcu=attiny861
attinyx61.menu.chip.861.upload.maximum_size=8192
attinyx61.menu.chip.861.upload.maximum_data_size=512
attinyx61.menu.chip.461=ATtiny461
attinyx61.menu.chip.461.build.mcu=attiny461
attinyx61.menu.chip.461.upload.maximum_size=4096
attinyx61.menu.chip.461.upload.maximum_data_size=256
attinyx61.menu.chip.261=ATtiny261
attinyx61.menu.chip.261.build.mcu=attiny261
attinyx61.menu.chip.261.upload.maximum_size=2048
attinyx61.menu.chip.261.upload.maximum_data_size=128
attinyx61.bootloader.extended_fuses=0xFF
attinyx61.menu.clock.8internal=8 MHz (internal)
attinyx61.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx61.menu.clock.8internal.build.f_cpu=8000000L
attinyx61.menu.clock.20external=20 MHz (external)
attinyx61.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.20external.build.f_cpu=20000000L
attinyx61.menu.clock.16external=16 MHz (external)
attinyx61.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.16external.build.f_cpu=16000000L
attinyx61.menu.clock.16pll=16 MHz (PLL)
attinyx61.menu.clock.16pll.bootloader.low_fuses=0xF1
attinyx61.menu.clock.16pll.build.f_cpu=16000000L
attinyx61.menu.clock.16pll.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.12external=12 MHz (external)
attinyx61.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.12external.build.f_cpu=12000000L
attinyx61.menu.clock.8external=8 MHz (external)
attinyx61.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.8external.build.f_cpu=8000000L
attinyx61.menu.clock.6external=6 MHz (external)
attinyx61.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.6external.build.f_cpu=6000000L
attinyx61.menu.clock.4external=4 MHz (external)
attinyx61.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.4external.build.f_cpu=4000000L
attinyx61.menu.clock.1internal=1 MHz (internal)
attinyx61.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx61.menu.clock.1internal.build.f_cpu=1000000L
attinyx61.menu.clock.737external=7.372 MHz (external)
attinyx61.menu.clock.737external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.737external.build.f_cpu=7372800L
attinyx61.menu.clock.92external=9.216 MHz (external)
attinyx61.menu.clock.92external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.92external.build.f_cpu=9216000L
attinyx61.menu.clock.11external=11.0592 MHz (external)
attinyx61.menu.clock.11external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.11external.build.f_cpu=11059200L
attinyx61.menu.clock.14external=14.7456 MHz (external)
attinyx61.menu.clock.14external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.14external.build.f_cpu=14745600L
attinyx61.menu.clock.184external=18.432 MHz (external)
attinyx61.menu.clock.184external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.184external.build.f_cpu=18432000L
attinyx61.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx61.menu.eesave.aenable=EEPROM retained
attinyx61.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx61.menu.eesave.disable=EEPROM not retained
attinyx61.menu.eesave.disable.bootloader.eesave_bit=1
attinyx61.menu.bod.disable=B.O.D. Disabled
attinyx61.menu.bod.disable.bootloader.bod_bits=111
attinyx61.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx61.menu.bod.1v8.bootloader.bod_bits=110
attinyx61.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx61.menu.bod.2v7.bootloader.bod_bits=101
attinyx61.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx61.menu.bod.4v3.bootloader.bod_bits=100
attinyx61.build.variant=tinyX61


attinyx41.name=ATtiny441/841 (No bootloader)
attinyx41.upload.tool=avrdude
attinyx41.bootloader.tool=avrdude
attinyx41.bootloader.unlock_bits=0xFF
attinyx41.bootloader.lock_bits=0xFF
attinyx41.bootloader.file=empty/empty_all.hex
attinyx41.build.core=tinymodern
attinyx41.build.board=AVR_ATTINYX41
attinyx41.build.export_merged_output=false
attinyx41.menu.chip.841=ATtiny841
attinyx41.menu.chip.841.build.mcu=attiny841
attinyx41.menu.chip.841.upload.maximum_size=8192
attinyx41.menu.chip.841.upload.maximum_data_size=512
attinyx41.menu.chip.441=ATtiny441
attinyx41.menu.chip.441.build.mcu=attiny441
attinyx41.menu.chip.441.upload.maximum_size=4096
attinyx41.menu.chip.441.upload.maximum_data_size=256
attinyx41.menu.LTO.disable=Disabled
attinyx41.menu.LTO.disable.ltocflags=
attinyx41.menu.LTO.disable.ltoelfflags=
attinyx41.menu.LTO.disable.ltocppflags=
attinyx41.menu.LTO.disable.ltoarcmd=
attinyx41.menu.LTO.enable=Enabled
attinyx41.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx41.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx41.menu.LTO.enable.ltocppflags=-flto
attinyx41.menu.LTO.enable.ltoarcmd=gcc-
attinyx41.menu.clock.8internal=8 MHz (internal)
attinyx41.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx41.menu.clock.8internal.bootloader.ulp_bits=111
attinyx41.menu.clock.8internal.build.f_cpu=8000000L
attinyx41.menu.clock.16external=16 MHz (external)
attinyx41.menu.clock.16external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.16external.bootloader.ulp_bits=111
attinyx41.menu.clock.16external.build.f_cpu=16000000L
attinyx41.menu.clock.12external=12 MHz (external)
attinyx41.menu.clock.12external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.12external.bootloader.ulp_bits=111
attinyx41.menu.clock.12external.build.f_cpu=12000000L
attinyx41.menu.clock.8external=8 MHz (external)
attinyx41.menu.clock.8external.bootloader.low_fuses=0xED
attinyx41.menu.clock.8external.bootloader.ulp_bits=111
attinyx41.menu.clock.8external.build.f_cpu=8000000L
attinyx41.menu.clock.737external=7.372 MHz (external)
attinyx41.menu.clock.737external.bootloader.low_fuses=0xED
attinyx41.menu.clock.737external.bootloader.ulp_bits=111
attinyx41.menu.clock.737external.build.f_cpu=7372800L
attinyx41.menu.clock.92external=9.216 MHz (external)
attinyx41.menu.clock.92external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.92external.bootloader.ulp_bits=111
attinyx41.menu.clock.92external.build.f_cpu=9216000L
attinyx41.menu.clock.11external=11.0592 MHz (external)
attinyx41.menu.clock.11external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.11external.bootloader.ulp_bits=111
attinyx41.menu.clock.11external.build.f_cpu=11059200L
attinyx41.menu.clock.14external=14.7456 MHz (external)
attinyx41.menu.clock.14external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.14external.bootloader.ulp_bits=111
attinyx41.menu.clock.14external.build.f_cpu=14745600L
attinyx41.menu.clock.184external=18.432 MHz (external - overclocked)
attinyx41.menu.clock.184external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.184external.bootloader.ulp_bits=111
attinyx41.menu.clock.184external.build.f_cpu=18432000L
attinyx41.menu.clock.1internal=1 MHz (internal)
attinyx41.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx41.menu.clock.1internal.bootloader.ulp_bits=111
attinyx41.menu.clock.1internal.build.f_cpu=1000000L
attinyx41.menu.clock.20external=20 MHz (external - overclocked)
attinyx41.menu.clock.20external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.20external.bootloader.ulp_bits=111
attinyx41.menu.clock.20external.build.f_cpu=20000000L
attinyx41.menu.clock.6external=6 MHz (external)
attinyx41.menu.clock.6external.bootloader.low_fuses=0xED
attinyx41.menu.clock.6external.bootloader.ulp_bits=111
attinyx41.menu.clock.6external.build.f_cpu=6000000L
attinyx41.menu.clock.4external=4 MHz (external)
attinyx41.menu.clock.4external.bootloader.low_fuses=0xED
attinyx41.menu.clock.4external.bootloader.ulp_bits=111
attinyx41.menu.clock.4external.build.f_cpu=4000000L
attinyx41.menu.clock.512internal=512 kHz (internal ULP)
attinyx41.menu.clock.512internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.512internal.bootloader.ulp_bits=011
attinyx41.menu.clock.512internal.build.f_cpu=512000L
attinyx41.menu.clock.256internal=256 kHz (internal ULP)
attinyx41.menu.clock.256internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.256internal.bootloader.ulp_bits=100
attinyx41.menu.clock.256internal.build.f_cpu=256000L
attinyx41.menu.clock.128internal=128 kHz (internal ULP)
attinyx41.menu.clock.128internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.128internal.bootloader.ulp_bits=101
attinyx41.menu.clock.128internal.build.f_cpu=128000L
attinyx41.menu.clock.64internal=64 kHz (internal ULP)
attinyx41.menu.clock.64internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.64internal.bootloader.ulp_bits=110
attinyx41.menu.clock.64internal.build.f_cpu=64000L
attinyx41.menu.clock.32internal=32 kHz (internal ULP)
attinyx41.menu.clock.32internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.32internal.bootloader.ulp_bits=111
attinyx41.menu.clock.32internal.build.f_cpu=32000L
attinyx41.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx41.bootloader.extended_fuses=0b{bootloader.ulp_bits}{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attinyx41.menu.eesave.aenable=EEPROM retained
attinyx41.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx41.menu.eesave.disable=EEPROM not retained
attinyx41.menu.eesave.disable.bootloader.eesave_bit=1
attinyx41.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx41.menu.bod.1v8.bootloader.bod_bits=110
attinyx41.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx41.menu.bod.2v7.bootloader.bod_bits=101
attinyx41.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx41.menu.bod.4v3.bootloader.bod_bits=100
attinyx41.menu.bodact.disabled=B.O.D. Disabled
attinyx41.menu.bodact.disabled.bootloader.bodact_bits=11
attinyx41.menu.bodact.enabled=B.O.D. Enabled
attinyx41.menu.bodact.enabled.bootloader.bodact_bits=10
attinyx41.menu.bodact.sampled=B.O.D. Sampled Mode
attinyx41.menu.bodact.sampled.bootloader.bodact_bits=01
attinyx41.menu.bodpd.disabled=B.O.D. Disabled
attinyx41.menu.bodpd.disabled.bootloader.bodpd_bits=11
attinyx41.menu.bodpd.enabled=B.O.D. Enabled
attinyx41.menu.bodpd.enabled.bootloader.bodpd_bits=10
attinyx41.menu.bodpd.sampled=B.O.D. Sampled Mode
attinyx41.menu.bodpd.sampled.bootloader.bodpd_bits=01


